---
title: Обновления [NEW]
permalink: /updates/
---

# Обновления
Тут собраны все обновления Telegram-бота **YamiGuard**.

---
  
## (⭐) Обновление 12.04.2024 | 19:41:44 Moscow Time:
- Добавлен конфигуратор (/config)
  - Настраивать чат еще стало легче. Благодаря этим настройкам: Установка максимальных предупреждений, и наказание; Установка правил; Установка приветственных и прощальных сообщений; Логгирование ( [Помощь](settings.cmd#Логи) ); Установка часового пояса; Удаление системных сообщений (возможны недоработки).

Для меня данное обновление является глобальным, поскольку я проделал колоссальные работы чтобы это работало адекватно.
